In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series(np.arange(3), index=['A','B','C'])

ser2 = 2*ser1

ser2

A    0
B    2
C    4
dtype: int32

In [3]:
ser2['B']

2

In [4]:
ser2[2]

4

In [5]:
ser1[['A','B']]

A    0
B    1
dtype: int32

In [6]:
ser1[ser1>3]

Series([], dtype: int32)

In [7]:
ser2[ser2>3]

C    4
dtype: int32

In [8]:
ser2[ser2>3] = 10

In [9]:
ser2

A     0
B     2
C    10
dtype: int32

In [11]:
df = DataFrame(np.arange(25).reshape((5,5)), index = ['Pune','Delhi','Mumbai','Bangalore','Kolkata'],columns = ['A','B','C','D','E'])

In [12]:
df

            A   B   C   D   E
Pune        0   1   2   3   4
Delhi       5   6   7   8   9
Mumbai     10  11  12  13  14
Bangalore  15  16  17  18  19
Kolkata    20  21  22  23  24

In [13]:
df['B']

Pune          1
Delhi         6
Mumbai       11
Bangalore    16
Kolkata      21
Name: B, dtype: int32

In [14]:
df[['B','D']]

            B   D
Pune        1   3
Delhi       6   8
Mumbai     11  13
Bangalore  16  18
Kolkata    21  23

In [18]:
df[df['B']>8]

            A   B   C   D   E
Mumbai     10  11  12  13  14
Bangalore  15  16  17  18  19
Kolkata    20  21  22  23  24

In [19]:
df > 10

               A      B      C      D      E
Pune       False  False  False  False  False
Delhi      False  False  False  False  False
Mumbai     False   True   True   True   True
Bangalore   True   True   True   True   True
Kolkata     True   True   True   True   True

In [21]:
df > 100

               A      B      C      D      E
Pune       False  False  False  False  False
Delhi      False  False  False  False  False
Mumbai     False  False  False  False  False
Bangalore  False  False  False  False  False
Kolkata    False  False  False  False  False